zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54016JET180-pinctrl.h
#define SD_BACKEND_PWR_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 2) /* PIO3_21 */
#define UTICK0_CAPTURE2_PIO3_21 IOCON_MUX(117, IOCON_TYPE_D, 4) /* PIO3_21 */
#define ADC0_CH10_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 0) /* PIO3_22 */
#define FC9_TXD_SCL_MISO_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 1) /* PIO3_22 */
#define GPIO_PIO322_PIO3_22 IOCON_MUX(118, IOCON_TYPE_D, 0) /* PIO3_22 */
#define FC2_CTS_SDA_SSEL0_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 1) /* PIO3_23 */
#define GPIO_PIO323_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 0) /* PIO3_23 */
#define UTICK0_CAPTURE3_PIO3_23 IOCON_MUX(119, IOCON_TYPE_D, 3) /* PIO3_23 */
#define CTIMER4_CAPTURE0_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 2) /* PIO3_24 */
#define FC2_RTS_SCL_SSEL1_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 1) /* PIO3_24 */
#define GPIO_PIO324_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 0) /* PIO3_24 */
#define USB0_VBUS_PIO3_24 IOCON_MUX(120, IOCON_TYPE_D, 3) /* PIO3_24 */
#define CTIMER4_CAPTURE2_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 2) /* PIO3_25 */
#define EMC_EMC_A14_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 6) /* PIO3_25 */
#define FC4_SCK_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 3) /* PIO3_25 */
#define GPIO_PIO325_PIO3_25 IOCON_MUX(121, IOCON_TYPE_D, 0) /* PIO3_25 */
#define EMC_EMC_A15_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 6) /* PIO3_26 */
#define FC4_RXD_SDA_MOSI_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 3) /* PIO3_26 */
#define GPIO_PIO326_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 0) /* PIO3_26 */
#define SCT0_OUT0_PIO3_26 IOCON_MUX(122, IOCON_TYPE_D, 2) /* PIO3_26 */
#define EMC_EMC_A16_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 6) /* PIO3_27 */
#define FC4_TXD_SCL_MISO_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 3) /* PIO3_27 */
#define GPIO_PIO327_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 0) /* PIO3_27 */
#define SCT0_OUT1_PIO3_27 IOCON_MUX(123, IOCON_TYPE_D, 2) /* PIO3_27 */
#define EMC_EMC_A17_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 6) /* PIO3_28 */
#define FC4_CTS_SDA_SSEL0_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 3) /* PIO3_28 */
#define GPIO_PIO328_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 0) /* PIO3_28 */
#define SCT0_OUT2_PIO3_28 IOCON_MUX(124, IOCON_TYPE_D, 2) /* PIO3_28 */
#define EMC_EMC_A18_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 6) /* PIO3_29 */
#define FC4_RTS_SCL_SSEL1_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 3) /* PIO3_29 */
#define GPIO_PIO329_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 0) /* PIO3_29 */
#define SCT0_OUT3_PIO3_29 IOCON_MUX(125, IOCON_TYPE_D, 2) /* PIO3_29 */
#define EMC_EMC_A19_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 6) /* PIO3_30 */
#define FC4_SSEL2_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 3) /* PIO3_30 */
#define FC9_CTS_SDA_SSEL0_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 1) /* PIO3_30 */
#define GPIO_PIO330_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 0) /* PIO3_30 */
#define SCT0_OUT4_PIO3_30 IOCON_MUX(126, IOCON_TYPE_D, 2) /* PIO3_30 */
#define CTIMER4_MATCH2_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 3) /* PIO3_31 */
#define EMC_EMC_A20_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 6) /* PIO3_31 */
#define FC9_RTS_SCL_SSEL1_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 1) /* PIO3_31 */
#define GPIO_PIO331_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 0) /* PIO3_31 */
#define SCT0_IN0_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN1_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN2_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN3_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN4_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN5_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_IN6_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 5) /* PIO3_31 */
#define SCT0_OUT5_PIO3_31 IOCON_MUX(127, IOCON_TYPE_D, 2) /* PIO3_31 */
#define CTIMER4_CAPTURE1_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 3) /* PIO4_0 */
#define EMC_EMC_CS1_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 6) /* PIO4_0 */
#define FC6_CTS_SDA_SSEL0_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 2) /* PIO4_0 */
#define GPIO_PIO40_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 0) /* PIO4_0 */
#define SCT0_IN0_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN1_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN2_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN3_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN4_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN5_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define SCT0_IN6_PIO4_0 IOCON_MUX(128, IOCON_TYPE_D, 5) /* PIO4_0 */
#define EMC_EMC_CS2_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 6) /* PIO4_1 */
#define FC6_SCK_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 2) /* PIO4_1 */
#define GPIO_PIO41_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 0) /* PIO4_1 */
#define SCT0_IN0_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN1_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN2_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN3_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN4_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN5_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define SCT0_IN6_PIO4_1 IOCON_MUX(129, IOCON_TYPE_D, 5) /* PIO4_1 */
#define EMC_EMC_CS3_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 6) /* PIO4_2 */
#define FC6_RXD_SDA_MOSI_DATA_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 2) /* PIO4_2 */
#define GPIO_PIO42_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 0) /* PIO4_2 */
#define SCT0_IN0_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN1_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN2_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN3_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN4_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN5_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define SCT0_IN6_PIO4_2 IOCON_MUX(130, IOCON_TYPE_D, 5) /* PIO4_2 */
#define CTIMER0_CAPTURE3_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 3) /* PIO4_3 */
#define EMC_EMC_DYCS2_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 6) /* PIO4_3 */
#define FC6_TXD_SCL_MISO_WS_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 2) /* PIO4_3 */
#define GPIO_PIO43_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 0) /* PIO4_3 */
#define SCT0_IN0_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN1_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN2_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN3_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN4_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN5_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define SCT0_IN6_PIO4_3 IOCON_MUX(131, IOCON_TYPE_D, 5) /* PIO4_3 */
#define EMC_EMC_DYCS3_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 6) /* PIO4_4 */
#define FC0_RTS_SCL_SSEL1_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 3) /* PIO4_4 */
#define FC4_SSEL3_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 2) /* PIO4_4 */
#define GPIO_PIO44_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 0) /* PIO4_4 */
#define SCT0_IN0_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN1_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN2_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN3_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN4_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN5_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define SCT0_IN6_PIO4_4 IOCON_MUX(132, IOCON_TYPE_D, 5) /* PIO4_4 */
#define CTIMER4_MATCH3_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 4) /* PIO4_5 */
#define EMC_EMC_CKE2_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 6) /* PIO4_5 */
#define FC0_CTS_SDA_SSEL0_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 3) /* PIO4_5 */
#define FC9_CTS_SDA_SSEL0_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 2) /* PIO4_5 */
#define GPIO_PIO45_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 0) /* PIO4_5 */
#define SCT0_IN0_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN1_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN2_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN3_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN4_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN5_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define SCT0_IN6_PIO4_5 IOCON_MUX(133, IOCON_TYPE_D, 5) /* PIO4_5 */
#define EMC_EMC_CKE3_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 6) /* PIO4_6 */
#define FC9_RTS_SCL_SSEL1_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 2) /* PIO4_6 */
#define GPIO_PIO46_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 0) /* PIO4_6 */
#define SCT0_IN0_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN1_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN2_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN3_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN4_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN5_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define SCT0_IN6_PIO4_6 IOCON_MUX(134, IOCON_TYPE_D, 5) /* PIO4_6 */
#define CTIMER4_CAPTURE3_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 2) /* PIO4_7 */
#define GPIO_PIO47_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 0) /* PIO4_7 */
#define SCT0_IN0_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN1_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN2_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN3_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN4_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN5_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define SCT0_IN6_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 5) /* PIO4_7 */
#define USB0_FRAME_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 4) /* PIO4_7 */
#define USB0_PORTPWRN_PIO4_7 IOCON_MUX(135, IOCON_TYPE_D, 3) /* PIO4_7 */
#define ENET_ENET_TXD0_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 1) /* PIO4_8 */
#define FC2_SCK_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 2) /* PIO4_8 */
#define GPIO_PIO48_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 0) /* PIO4_8 */
#define SCT0_IN0_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN1_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN2_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN3_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN4_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN5_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define SCT0_IN6_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 5) /* PIO4_8 */
#define USB0_LEDN_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 4) /* PIO4_8 */
#define USB0_OVERCURRENTN_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 3) /* PIO4_8 */
#define ENET_ENET_TXD1_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 1) /* PIO4_9 */
#define FC2_RXD_SDA_MOSI_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 2) /* PIO4_9 */
#define GPIO_PIO49_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 0) /* PIO4_9 */
#define SCT0_IN0_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN1_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN2_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN3_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN4_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN5_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define SCT0_IN6_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 5) /* PIO4_9 */
#define USB1_FRAME_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 4) /* PIO4_9 */
#define USB1_PORTPWRN_PIO4_9 IOCON_MUX(137, IOCON_TYPE_D, 3) /* PIO4_9 */
#define ENET_RX_DV_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 1) /* PIO4_10 */
#define FC2_TXD_SCL_MISO_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 2) /* PIO4_10 */
#define GPIO_PIO410_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 0) /* PIO4_10 */
#define SCT0_IN0_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN1_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN2_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN3_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN4_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN5_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define SCT0_IN6_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 5) /* PIO4_10 */
#define USB1_LEDN_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 4) /* PIO4_10 */
#define USB1_OVERCURRENTN_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 3) /* PIO4_10 */
#define ENET_ENET_RXD0_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 1) /* PIO4_11 */
#define FC2_CTS_SDA_SSEL0_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 2) /* PIO4_11 */
#define GPIO_PIO411_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 0) /* PIO4_11 */
#define SCT0_IN0_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN1_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN2_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN3_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN4_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN5_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define SCT0_IN6_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 5) /* PIO4_11 */
#define USB0_IDVALUE_PIO4_11 IOCON_MUX(139, IOCON_TYPE_D, 3) /* PIO4_11 */
#define ENET_ENET_RXD1_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 1) /* PIO4_12 */
#define FC2_RTS_SCL_SSEL1_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 2) /* PIO4_12 */
#define GPIO_PIO412_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 0) /* PIO4_12 */
#define SCT0_IN0_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN1_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN2_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN3_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN4_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN5_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define SCT0_IN6_PIO4_12 IOCON_MUX(140, IOCON_TYPE_D, 5) /* PIO4_12 */
#define CTIMER4_MATCH0_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 2) /* PIO4_13 */
#define ENET_TX_EN_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 1) /* PIO4_13 */
#define GPIO_PIO413_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 0) /* PIO4_13 */
#define SCT0_IN0_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN1_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN2_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN3_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN4_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN5_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define SCT0_IN6_PIO4_13 IOCON_MUX(141, IOCON_TYPE_D, 5) /* PIO4_13 */
#define CTIMER4_MATCH1_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 2) /* PIO4_14 */
#define ENET_RX_CLK_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 1) /* PIO4_14 */
#define FC9_SCK_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 3) /* PIO4_14 */
#define GPIO_PIO414_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 0) /* PIO4_14 */
#define SCT0_IN0_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN1_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN2_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN3_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN4_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN5_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define SCT0_IN6_PIO4_14 IOCON_MUX(142, IOCON_TYPE_D, 5) /* PIO4_14 */
#define CTIMER4_MATCH2_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 2) /* PIO4_15 */
#define ENET_MDC_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 1) /* PIO4_15 */
#define FC9_RXD_SDA_MOSI_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 3) /* PIO4_15 */
#define GPIO_PIO415_PIO4_15 IOCON_MUX(143, IOCON_TYPE_D, 0) /* PIO4_15 */
#define CTIMER4_MATCH3_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 2) /* PIO4_16 */
#define ENET_MDIO_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 1) /* PIO4_16 */
#define FC9_TXD_SCL_MISO_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 3) /* PIO4_16 */
#define GPIO_PIO416_PIO4_16 IOCON_MUX(144, IOCON_TYPE_D, 0) /* PIO4_16 */

#endif
